load-tests/artillery-config.yml
# Artillery load test – Application Formulaires de Chantier
# 6 phases, 10 minutes total. Target: http://localhost:3000
config:
  target: "http://localhost:3000"
  http:
    timeout: 30

phases:
  - duration: 60
    arrivalRate: 5
    name: "Préchauffage"
  - duration: 120
    arrivalRate: 5
    rampTo: 20
    name: "Montée en Charge"
  - duration: 180
    arrivalRate: 20
    name: "Charge Soutenue"
  - duration: 120
    arrivalRate: 20
    rampTo: 50
    name: "Charge de Pointe"
  - duration: 60
    arrivalRate: 50
    rampTo: 100
    name: "Test de Stress"
  - duration: 60
    arrivalRate: 1
    name: "Refroidissement"

scenarios:
  - name: "Navigation Accueil et Tableau de Bord"
    weight: 30
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
      - get:
          url: "/login"
          expect:
            - statusCode: 200
  - name: "Flux de Travail"
    weight: 25
    flow:
      - get:
          url: "/inspections"
          expect:
            - statusCode: 200
      - get:
          url: "/observations"
          expect:
            - statusCode: 200
  - name: "Flux de Travail Observations"
    weight: 25
    flow:
      - get:
          url: "/observations"
          expect:
            - statusCode: 200
  - name: "Flux de Travail Incidents"
    weight: 15
    flow:
      - get:
          url: "/incidents"
          expect:
            - statusCode: 200
  - name: "Paramètres et Ressources"
    weight: 5
    flow:
      - get:
          url: "/livrables"
          expect:
            - statusCode: 200
      - get:
          url: "/settings"
          expect:
            - statusCode: 200